[
    {
        "사자성어": "고진감래",
        "뜻": "괴로움이 다하면 달콤함이 온다는 뜻으로 고생 끝에 낙이 온다는 말",
        "예시": "ㅁㅁㅁㅁ라더니! 드디어 방학이네!"
      },
      {
        "사자성어": "구사일생",
        "뜻": "아홉 번 죽을 뻔하다 한 번 살아난다는 뜻으로 죽을 고비를 여러 번 넘기고 간신히 목숨을 건진다는 말",
        "예시": "오늘 게임에서 큰일날 뻔 했는데 ㅁㅁㅁㅁ했어!"
      },
      {
        "사자성어": "과유불급",
        "뜻": "정도가 지나친 것은 부족한 것보다 못하다는 말",
        "예시": "맛있는 음식을 먹으면 기분이 좋지만 ㅁㅁㅁㅁ이야!"
      },
    {
      "사자성어": "괄목상대",
      "뜻": "눈을 비비고 다시 본다는 뜻으로 상대방의 학문이나 재주가 깜짝 놀랄 만큼 발전했음을 이르는 말",
      "예시": "친구가 방학 동안 공부를 많이 해서 ㅁㅁㅁㅁ할 만큼 성적이 올랐네!"
    },
    {
      "사자성어": "근묵자흑",
      "뜻": "먹을 가까이하면 검어진다는 뜻으로 좋지 못한 사람과 가까이 지내면 나쁜 것에 물들게 된다는 말",
      "예시": "나쁜 친구와 어울리면 ㅁㅁㅁㅁ이 될 수도 있어!"
    },
    {
      "사자성어": "다다익선",
      "뜻": "많으면 많을수록 더욱 좋다는 말",
      "예시": "책은 너무 재밌으니까 ㅁㅁㅁㅁ이야!"
    },
    {
      "사자성어": "대동소이",
      "뜻": "큰 차이가 없이 거의 같고 조금 다르다는 말",
      "예시": "초코라떼랑 초코우유는 ㅁㅁㅁㅁ한 음료이에요!"
    },
    {
      "사자성어": "동병상련",
      "뜻": "같은 병을 앓는 사람끼리 서로 가엾게 여긴다는 뜻으로 어려운 처지에 있는 사람끼리 서로 동정하고 공감한다는 말",
      "예시": "장마 때문에 놀러가지 못한 친구에게 ㅁㅁㅁㅁ을 느꼈어요."
    },
    {
      "사자성어": "문전성시",
      "뜻": "문 앞이 시장을 이룬다는 뜻으로 권세가 있거나 부자가 되어 집 문 앞이 방문객으로 넘쳐난다는 말",
      "예시": "어제 새로 오픈한 마라탕집이 ㅁㅁㅁㅁ를 이루었어!"
    },
    {
      "사자성어": "백발백중",
      "뜻": "백 번 쏘아 백 번 맞춘다는 뜻으로 모든 일이 계획대로 들어맞는다는 말",
      "예시": "주몽은 ㅁㅁㅁㅁ의 활솜씨로 유명해!"
    },
    {
      "사자성어": "사면초가",
      "뜻": "동서남북 사방에서 들려오는 초나라의 노래라는 뜻으로 누구에게도 도움을 받을 수 없는 고립된 상태에 처했다는 말",
      "예시": "어려운 수학 예시를 푸는데 도와줄 사람이 없어서 ㅁㅁㅁㅁ였어."
    },
    {
      "사자성어": "살신성인",
      "뜻": "자기 몸을 희생하여 옳은 일을 이룬다는 뜻으로 의로운 일을 위해 목숨을 버린다는 말",
      "예시": "화재 속에서 소방관이 시민들을 구하기 위해 ㅁㅁㅁㅁ했어요!"
    },
    {
      "사자성어": "설상가상",
      "뜻": "눈 위에 서리까지 더한다는 뜻으로 어려운 일이나 불행이 겹쳐서 한꺼번에 일어남을 이르는 말",
      "예시": "늦잠 자서 큰일이었는데, ㅁㅁㅁㅁ으로 핸드폰을 못 찾아서 지각했어."
    },
    {
      "사자성어": "아전인수",
      "뜻": "자기 논에 물 대기라는 뜻으로 자기의 이익만 먼저 생각하고 행동한다는 말",
      "예시": "치킨을 먹는데 친구가 닭다리를 다 먹어서 완전 ㅁㅁㅁㅁ였어요."
    },
    {
      "사자성어": "역지사지",
      "뜻": "입장을 바꾸어 다른 사람의 처지에서 생각하라는 말",
      "예시": "친구와 싸웠는데 ㅁㅁㅁㅁ하니 친구의 마음이 이해가 돼."
    },
    {
      "사자성어": "우이독경",
      "뜻": "쇠귀에 경 읽기라는 뜻으로 아무리 가르치고 알려 주어도 도무지 알아듣지 못함을 이르는 말",
      "예시": "내 동생은 말을 너무 안들어. 완전 ㅁㅁㅁㅁ이야."
    },
    {
      "사자성어": "자업자득",
      "뜻": "자기의 일은 자기가 받는다는 뜻으로 자신이 저지른 나쁜 행동이나 잘못이 결국 자기에게 되돌아온다는 말",
      "예시": "공부를 열심히 하지 않아 성적이 떨어진 것은 ㅁㅁㅁㅁ이지!"
    },
    {
      "사자성어": "죽마고우",
      "뜻": "죽마를 타고 놀던 친구라는 뜻으로 어려서부터 함께 자란 친구를 이르는 말",
      "예시": "유치원 때부터 함께한 친구는 내 ㅁㅁㅁㅁ이에요!"
    },
    {
      "사자성어": "청출어람",
      "뜻": "푸른색은 쪽빛에서 나왔지만, 쪽빛보다 더 푸르다는 뜻으로 제자가 스승보다 나음을 비유하여 이르는 말",
      "예시": "ㅁㅁㅁㅁ이라더니, 동생한테 리코더 부는 법을 가르쳤는데 이제 동생이 나보다 더 잘해!"
    },
    {
      "사자성어": "촌철살인",
      "뜻": "한 치의 칼로 사람을 죽인다는 뜻으로 간단한 말로도 사람을 감동하게 할 수 있음을 이르는 말",
      "예시": "저 선생님은 무서운데 하는 말들이 전부 ㅁㅁㅁㅁ이야."
    },
    {
      "사자성어": "타산지석",
      "뜻": "다른 산의 돌이라는 뜻으로 다른 사람의 실수도 나에게 교훈이 될 수 있음을 이르는 말",
      "예시": "오빠가 부모님한테 혼나는걸 보고 ㅁㅁㅁㅁ으로 삼았어."
    },
    {
      "사자성어": "토사구팽",
      "뜻": "토끼가 죽으면 사냥개를 없앤다는 뜻으로 필요할 때 실컷 부려 먹다가 쓸모가 없어지면 헌신짝처럼 내버린다는 말",
      "예시": "나의 가장 친한 친구가 점점 필요할때만 찾는 것이 ㅁㅁㅁㅁ처럼 느껴졌어."
    },
    {
      "사자성어": "파죽지세",
      "뜻": "대나무를 쪼개는 기세라는 뜻으로 적을 거침없이 물리치고 당당하게 쳐들어가는 기세를 이르는 말",
      "예시": "이번 축구 경기에서 우리나라가 ㅁㅁㅁㅁ로 경기를 이겼어!"
    },
    {
      "사자성어": "풍전등화",
      "뜻": "바람 앞에 놓인 등불이라는 뜻으로 매우 위태로움을 이르는 말",
      "예시": "내일 시험인데 하루종일 게임만 하는 친구의 상황이 ㅁㅁㅁㅁ으로 느껴졌어."
    },
    {
      "사자성어": "함흥차사",
      "뜻": "심부름을 간 사람이 아무 소식이 없을 때 이르는 말",
      "예시": "친구가 탕후루를 사다주기로 했는데 아직도 ㅁㅁㅁㅁ야."
    }
  ]